In [1]:
import numpy as np
import pandas as pd

##### Create Series
        1) List
        2) numpy array
        3) or dict

In [2]:
pd.Series()

C:\Users\ROOPAG~1\AppData\Local\Temp/ipykernel_28944/2031691219.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [3]:
# using list
my_list = [10,20,30]
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
### index can be number or string
ser1 = pd.Series(my_list , index = ['a','ABX', 'c'])
ser1

a      10
ABX    20
c      30
dtype: int64

In [5]:
ser1['a']

10

In [6]:
## using numpy 
arr = np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [7]:
pd.Series(arr , index = ['I','II', 'III','IV','a'])

I      1
II     2
III    3
IV     4
a      5
dtype: int32

In [17]:
# using dictionary
d = {'a':1 , 'b': 2 , 'c' :3}
pd.Series(d)

a    1
b    2
c    3
dtype: int64

##### how to access elements of a series

In [18]:
data = np.array(['p' ,'y' , 't','h','o','n'])
ser = pd.Series(data)
ser

0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

In [19]:
ser[[0,5]]

0    p
5    n
dtype: object

In [20]:
ser[2]

't'

In [21]:
# 'o'
ser[4]

'o'

In [22]:
ser[0:4]

0    p
1    y
2    t
3    h
dtype: object

In [23]:
ser[2:5
   ]

2    t
3    h
4    o
dtype: object

In [24]:
## operations on Series : use to done on basis of index
ser1 = pd.Series([1,2,3,4] , index = ['USA' ,'Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [25]:
#access elements of series with index non-integer

ser1['USA']

1

In [26]:
ser1[0:3]

USA        1
Germany    2
USSR       3
dtype: int64

In [27]:
ser1['USA':'USSR']

USA        1
Germany    2
USSR       3
dtype: int64

In [28]:
ser2 = pd.Series([1,2,5,4] , index = ['USA' ,'Germany' , 'Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [29]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [30]:
ser1*ser2

Germany     4.0
Italy       NaN
Japan      16.0
USA         1.0
USSR        NaN
dtype: float64

In [31]:
ser1/ser2

Germany    1.0
Italy      NaN
Japan      1.0
USA        1.0
USSR       NaN
dtype: float64

In [32]:
ser1*2

USA        2
Germany    4
USSR       6
Japan      8
dtype: int64

In [33]:
ser1[ser1<2]

USA    1
dtype: int64

In [34]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [35]:
ser1.argmax()

3

## How to create Dataframe

In [36]:
df = pd.DataFrame( np.random.rand(4,4) 
                 )
df

          0         1         2         3
0  0.104777  0.075971  0.215586  0.226344
1  0.570451  0.210353  0.164903  0.805220
2  0.292634  0.314441  0.399017  0.590731
3  0.675384  0.167275  0.513981  0.385961

In [37]:
df = pd.DataFrame( np.random.rand(4,4) 
                 , index = ['A' ,'B' , 'C' ,'D'],
                 columns = ['W' ,'X' ,'Y','Z']
                 )
df

          W         X         Y         Z
A  0.276257  0.060610  0.980760  0.519051
B  0.656019  0.666648  0.289688  0.906521
C  0.847886  0.834044  0.561379  0.288943
D  0.062293  0.449806  0.379105  0.830870

In [38]:
# how to access column in dataframe
df['W']

A    0.276257
B    0.656019
C    0.847886
D    0.062293
Name: W, dtype: float64

In [39]:
df[['W' ,'Z']]

          W         Z
A  0.276257  0.519051
B  0.656019  0.906521
C  0.847886  0.288943
D  0.062293  0.830870

In [40]:
df['new'] = df['W'] +df['Z']
df

          W         X         Y         Z       new
A  0.276257  0.060610  0.980760  0.519051  0.795308
B  0.656019  0.666648  0.289688  0.906521  1.562539
C  0.847886  0.834044  0.561379  0.288943  1.136828
D  0.062293  0.449806  0.379105  0.830870  0.893162

## practice question :
        1) "add" = W +Z
        2) "multi" = W*2
        3) "divide" = x/y

In [41]:
df['add'] = df['W'] + df['Z']
df['multi'] = df['W']*2
df['divide'] = df['X']/df['Y']
df

,W,X,Y,Z,new,add,multi,divide
A,0.276257,0.060610,0.980760,0.519051,0.795308,0.795308,0.552514,0.061799
B,0.656019,0.666648,0.289688,0.906521,1.562539,1.562539,1.312037,2.301261
C,0.847886,0.834044,0.561379,0.288943,1.136828,1.136828,1.695771,1.485705
D,0.062293,0.449806,0.379105,0.830870,0.893162,0.893162,0.124585,1.186495

##### How to remove columns and rows from the dataframe

In [42]:
df.drop(columns =['multi'] , axis =1 , inplace=True )

In [43]:
df.drop(columns = ['divide'] , axis =1 )

          W         X         Y         Z       new       add
A  0.276257  0.060610  0.980760  0.519051  0.795308  0.795308
B  0.656019  0.666648  0.289688  0.906521  1.562539  1.562539
C  0.847886  0.834044  0.561379  0.288943  1.136828  1.136828
D  0.062293  0.449806  0.379105  0.830870  0.893162  0.893162

In [44]:
df

          W         X         Y         Z       new       add    divide
A  0.276257  0.060610  0.980760  0.519051  0.795308  0.795308  0.061799
B  0.656019  0.666648  0.289688  0.906521  1.562539  1.562539  2.301261
C  0.847886  0.834044  0.561379  0.288943  1.136828  1.136828  1.485705
D  0.062293  0.449806  0.379105  0.830870  0.893162  0.893162  1.186495

In [45]:
df.drop(columns = ['new' ,'add'] , axis =1 , inplace = True) # column based if axis =1

In [46]:
df

          W         X         Y         Z    divide
A  0.276257  0.060610  0.980760  0.519051  0.061799
B  0.656019  0.666648  0.289688  0.906521  2.301261
C  0.847886  0.834044  0.561379  0.288943  1.485705
D  0.062293  0.449806  0.379105  0.830870  1.186495

In [47]:
df.drop(index = ['B'] , axis = 0 ,inplace = True) # row- based operation
df

          W         X         Y         Z    divide
A  0.276257  0.060610  0.980760  0.519051  0.061799
C  0.847886  0.834044  0.561379  0.288943  1.485705
D  0.062293  0.449806  0.379105  0.830870  1.186495

## missing data
        1) Ignore the missing values
        2) impute the filling values

In [48]:
import numpy as np
df = pd.DataFrame(
        {
                'A' :[1,2,np.nan],
                'B' :[5, np.nan , np.nan],
                'C' :[1,2,3]
        }
)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [49]:
df.dropna() # renove all the rows where at least 1 missing value

     A    B  C
0  1.0  5.0  1

In [50]:
df.dropna(axis  = 1)# renove all the columns where at least 1 missing value

   C
0  1
1  2
2  3

In [51]:
# how to impute
df.fillna(value = "Fill")

      A     B  C
0   1.0   5.0  1
1   2.0  Fill  2
2  Fill  Fill  3

In [52]:
df.fillna(value = df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [53]:
df.fillna(value = df.median())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## loc and iloc function in pandas
        uses to access elements in the data frame
        
        loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select.
        loc() method includes the last element of the range passed in it unlike iloc
        
        iloc() function is an index based selecting method which means that we have to pass an integer index in the method to select a specific row/column

In [60]:
import pandas as pd
import numpy as np

In [55]:
df = pd.DataFrame( np.random.rand(4,4) 
                 , index = ['A' ,'B' , 'C' ,'D'],
                 columns = ['W' ,'X' ,'Y','Z']
                 )
df

          W         X         Y         Z
A  0.230442  0.441771  0.000712  0.074146
B  0.650306  0.443978  0.128411  0.433510
C  0.055411  0.510178  0.740348  0.088520
D  0.152078  0.122564  0.149291  0.846567

In [56]:
# access row at index A and column from x to y

df.loc[ 'A', 'X':'Z' ]

X    0.441771
Y    0.000712
Z    0.074146
Name: A, dtype: float64

In [57]:
# row B and D and all columns
df.loc[['B','D'] , :]

          W         X         Y         Z
B  0.650306  0.443978  0.128411  0.433510
D  0.152078  0.122564  0.149291  0.846567

In [58]:
# row 'B' and 'D' and column 'X' and 'Z'

df.loc[['B','D'] , ['X','Z']]

          X         Z
B  0.443978  0.433510
D  0.122564  0.846567

In [59]:
# row from "B" to "D" and columns from "W":"Z"
df.loc['B':'D' , 'W':'Z']

          W         X         Y         Z
B  0.650306  0.443978  0.128411  0.433510
C  0.055411  0.510178  0.740348  0.088520
D  0.152078  0.122564  0.149291  0.846567

In [65]:
df

          W         X         Y         Z
A  0.230442  0.441771  0.000712  0.074146
B  0.650306  0.443978  0.128411  0.433510
C  0.055411  0.510178  0.740348  0.088520
D  0.152078  0.122564  0.149291  0.846567

In [64]:
df.iloc[0:2 , 0:3]

          W         X         Y
A  0.230442  0.441771  0.000712
B  0.650306  0.443978  0.128411

In [66]:
df.iloc[[2] , :]

          W         X         Y        Z
C  0.055411  0.510178  0.740348  0.08852

## Practice Questions:
    1) row b and c and column X:Z
    2) all rows and one column ie 'W'
    3) print row from A: C and column W:Y

In [63]:
df.loc['B':'C','X':'Z']
df.loc[: , 'W']
df.loc['A':'C' , 'W':'Y']

          W         X         Y
A  0.230442  0.441771  0.000712
B  0.650306  0.443978  0.128411
C  0.055411  0.510178  0.740348

In [70]:
df

          W         X         Y         Z
A  0.230442  0.441771  0.000712  0.074146
B  0.650306  0.443978  0.128411  0.433510
C  0.055411  0.510178  0.740348  0.088520
D  0.152078  0.122564  0.149291  0.846567

In [71]:
df.iloc[1:3 , 1:4]

          X         Y        Z
B  0.443978  0.128411  0.43351
C  0.510178  0.740348  0.08852

In [72]:
#all rows and one column ie 'W'
df.iloc[: , 0]

A    0.230442
B    0.650306
C    0.055411
D    0.152078
Name: W, dtype: float64

In [73]:
# print row from A: C and column W:Y
df.iloc[0:3 , 0:3]

          W         X         Y
A  0.230442  0.441771  0.000712
B  0.650306  0.443978  0.128411
C  0.055411  0.510178  0.740348

In [68]:
df.iloc[0 , -1]

0.07414592373767592

## how to read and write csv/excel files in Jupyter notebook

In [2]:
# check the directory of jupyter notebook
import os
os.getcwd()

In [79]:
data = pd.read_excel(r'test.xlsx')

In [77]:
data.head()

   A  B
0  1  2

In [81]:
# export the data from jupyter notebook to local system
data.to_csv(r'output.csv',
             index = False)

In [82]:
## conditional selection
df

          W         X         Y         Z
A  0.230442  0.441771  0.000712  0.074146
B  0.650306  0.443978  0.128411  0.433510
C  0.055411  0.510178  0.740348  0.088520
D  0.152078  0.122564  0.149291  0.846567

In [85]:
df[df['W']  > 0.06] # filter on the datframe
# return all the rows of column 'W' where value is greater than 0.06

          W         X         Y         Z
A  0.230442  0.441771  0.000712  0.074146
B  0.650306  0.443978  0.128411  0.433510
D  0.152078  0.122564  0.149291  0.846567

In [86]:
df[df['X'] <0.4]

          W         X         Y         Z
D  0.152078  0.122564  0.149291  0.846567

In [87]:
import numpy as np
df1 = pd.DataFrame(
        {
                'A' :[1,2,3],
                'B' :[5, 2 , 1],
                'C' :[1,2,3]
        }
)
df1

   A  B  C
0  1  5  1
1  2  2  2
2  3  1  3

In [96]:
df1[df1['A'] > 1]

   A  B  C
1  2  2  2
2  3  1  3

In [99]:
df1[(df1['A']==2) |(df1['B']==3)][['A','B']]

   A  B
1  2  2

In [101]:
df1[['A','B']][(df1['A']==2) |(df1['B']==3)][['A','B']]

   A  B
1  2  2

In [94]:
df1[df1['B']!=2]

   A  B  C
0  1  5  1
2  3  1  3

#### Merging , Joining and Concatenating

        different ways of combining multiple dataframes

In [130]:
df1 = pd.DataFrame({
    'A' : ['A0' ,'A1' ,'A2','A3'],
    'B' :['B0' ,'B1' ,'B2','B3'],
    'C' :['C0' ,'C1' ,'C2','C3'],
    'D' :['D0' ,'D1' ,'D2','D3'] },
    index = [0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [131]:
df2 = pd.DataFrame({
    'A' : ['A1' ,'A5' ,'A6','A7'],
    'B' :['B1' ,'B5' ,'B6','B7'],
    'C' :['C0' ,'C1' ,'C2','C3'],
    'D' :['D0' ,'D1' ,'D2','D3']},
    index =[1,5,6,7]
    
)
df2

    A   B   C   D
1  A1  B1  C0  D0
5  A5  B5  C1  D1
6  A6  B6  C2  D2
7  A7  B7  C3  D3

## concatenate:
        basically glues together the dataframes

In [124]:
df_conc = pd.concat([df1 , df2])# combine dataframes row-wise
df_conc

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A1  B1  C0  D0
5  A5  B5  C1  D1
6  A6  B6  C2  D2
7  A7  B7  C3  D3

In [125]:
df_conc1 = pd.concat([df1 , df2] , axis =1 ) # combine dataframe column-wise
df_conc1

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A1   B1   C0   D0
5  NaN  NaN  NaN  NaN   A5   B5   C1   D1
6  NaN  NaN  NaN  NaN   A6   B6   C2   D2
7  NaN  NaN  NaN  NaN   A7   B7   C3   D3

## Merging
        is similar like merge two tables in SQL: inner , left , right

In [126]:
pd.merge(df1 , df2 , how = 'inner' , on='A')

    A B_x C_x D_x B_y C_y D_y
0  A1  B1  C1  D1  B1  C0  D0

In [127]:
pd.merge(df1 , df2 , how = 'inner' , on = ['A','B'])

    A   B C_x D_x C_y D_y
0  A1  B1  C1  D1  C0  D0

## Joining
    is a method for combining the columns of two dataframe

In [134]:
df1.join(df2 ,lsuffix ='_x')

  A_x B_x C_x D_x    A    B    C    D
0  A0  B0  C0  D0  NaN  NaN  NaN  NaN
1  A1  B1  C1  D1   A1   B1   C0   D0
2  A2  B2  C2  D2  NaN  NaN  NaN  NaN
3  A3  B3  C3  D3  NaN  NaN  NaN  NaN

In [136]:
df1.join(df2 ,lsuffix ='_x' , how ='outer')

   A_x  B_x  C_x  D_x    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1   A1   B1   C0   D0
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN   A5   B5   C1   D1
6  NaN  NaN  NaN  NaN   A6   B6   C2   D2
7  NaN  NaN  NaN  NaN   A7   B7   C3   D3